export enum tones {
  "C" = 0,
  "C#" = 1,
  "D" = 2,
  "D#" = 3,
  "E" = 4,
  "F" = 5,
  "F#" = 6,
  "G" = 7,
  "G#" = 8,
  "A" = 9,
  "A#" = 10,
  "B" = 11,
}
export enum intervals {
  "прима" = 0,
  "малая секунда" = 1,
  "большая секунда" = 2,
  "малая терция" = 3,
  "большая терция" = 4,
  "кварта" = 5,
  "тритон" = 6,
  "квинта" = 7,
  "малая секста" = 8,
  "большая секста" = 9,
  "малая септима" = 10,
  "большая септима" = 11,
  "октава" = 12,
}
export const allTones = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11];
export const allIntervals = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12];
